results/cpu-vs-latency2/memcached/12-2/nsl205.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2140386 ops,   65431 (avg:   71345) ops/sec, 2.47MB/sec (avg: 2.69MB/sec),  0.36 (avg:  0.33) msec latency

2         Threads
12        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6486.41          ---          ---      0.33600       480.82
Gets       64859.54     29024.70     35834.84      0.33300      2274.42
Totals     71345.95     29024.70     35834.84      0.33300      2755.25


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.054      0.00005
GET       0.056      0.00015
GET       0.058      0.00021
GET       0.060      0.00046
GET       0.061      0.00062
GET       0.062      0.00087
GET       0.063      0.00128
GET       0.064      0.00190
GET       0.065      0.00221
GET       0.066      0.00298
GET       0.067      0.00375
GET       0.068      0.00555
GET       0.069      0.00678
GET       0.070      0.00858
GET       0.071      0.01028
GET       0.072      0.01218
GET       0.073      0.01506
GET       0.074      0.01788
GET       0.075      0.02133
GET       0.076      0.02529
GET       0.077      0.02924
GET       0.078      0.03402
GET       0.079      0.04034
GET       0.080      0.04620
GET       0.081      0.05381
GET       0.082      0.06275
GET       0.083      0.07241
GET       0.084      0.08377
GET       0.085      0.09600
GET       0.086      0.11060
GET       0.087      0.12715
GET       0.088      0.14899
GET       0.089      0.17371
GET       0.090      0.20033
GET       0.091      0.23332
GET       0.092      0.27069
GET       0.093      0.31262
GET       0.094      0.36196
GET       0.095      0.41114
GET       0.096      0.46454
GET       0.097      0.52236
GET       0.098      0.57894
GET       0.099      0.63840
GET       0.100      0.95164
GET       0.110      1.49656
GET       0.120      1.91655
GET       0.130      2.29377
GET       0.140      2.88957
GET       0.150      3.69161
GET       0.160      4.53157
GET       0.170      5.62583
GET       0.180      7.52290
GET       0.190     11.34638
GET       0.200     16.96876
GET       0.210     23.11058
GET       0.220     29.50278
GET       0.230     36.23762
GET       0.240     43.56902
GET       0.250     49.62378
GET       0.260     53.74621
GET       0.270     56.49265
GET       0.280     58.35939
GET       0.290     59.67336
GET       0.300     60.62813
GET       0.310     61.40828
GET       0.320     62.18303
GET       0.330     63.06976
GET       0.340     64.18514
GET       0.350     65.52516
GET       0.360     67.01951
GET       0.370     68.64641
GET       0.380     70.44840
GET       0.390     72.35035
GET       0.400     74.17906
GET       0.410     75.86896
GET       0.420     77.38778
GET       0.430     78.74317
GET       0.440     79.97449
GET       0.450     81.01766
GET       0.460     81.91555
GET       0.470     82.68156
GET       0.480     83.38030
GET       0.490     84.03083
GET       0.500     84.63382
GET       0.510     85.18532
GET       0.520     85.71960
GET       0.530     86.25527
GET       0.540     86.80929
GET       0.550     87.36983
GET       0.560     87.91413
GET       0.570     88.45782
GET       0.580     89.00839
GET       0.590     89.56852
GET       0.600     90.14551
GET       0.610     90.71397
GET       0.620     91.28376
GET       0.630     91.88187
GET       0.640     92.48204
GET       0.650     93.06956
GET       0.660     93.65744
GET       0.670     94.22415
GET       0.680     94.77098
GET       0.690     95.29739
GET       0.700     95.79138
GET       0.710     96.23542
GET       0.720     96.65889
GET       0.730     97.03514
GET       0.740     97.36462
GET       0.750     97.65309
GET       0.760     97.89926
GET       0.770     98.11275
GET       0.780     98.28589
GET       0.790     98.42645
GET       0.800     98.53751
GET       0.810     98.62735
GET       0.820     98.69452
GET       0.830     98.74838
GET       0.840     98.79134
GET       0.850     98.82279
GET       0.860     98.84787
GET       0.870     98.86771
GET       0.880     98.88513
GET       0.890     98.90302
GET       0.900     98.91916
GET       0.910     98.93611
GET       0.920     98.95462
GET       0.930     98.97384
GET       0.940     98.99326
GET       0.950     99.01562
GET       0.960     99.04039
GET       0.970     99.06593
GET       0.980     99.09117
GET       0.990     99.12293
GET       1.000     99.31339
GET       1.100     99.60201
GET       1.200     99.79916
GET       1.300     99.94378
GET       1.400     99.99111
GET       1.500     99.99820
GET       1.600     99.99928
GET       1.700     99.99949
GET       1.900     99.99990
GET       2.000    100.00000